// 1. +++ зробити затримку на натискання пошуку, щоб людина не нажимала купу разів підря на 500 мс
// 2. +++ зробити клас на скролff
// 3. +++ зробити на скролі затримку спрацювання події скролу 300 мс
// 4. +++ зробити в класі скрол перевірку куди крутимося і якщо догори, то не робимо запит на дані.
// 5. +++ якщо крутимо вниз, то відслідковуємо скліьки прокрутів, якщо прокрутилися нижче
//    +++ ніж задане число, то вже не посилаємо запит на дані
// 6. +++ зробити кнопку прокрути догори,
//    +++ її висвічувати внизу екрану тільки тоді коли з екрану пропав хеадер
//    +++ якщо хеадер появився - ховати кнопку
// 7. підключити галерею -
//    для цього переформатувати картку на адреси для галереї
//    перевірити як працює
// 8. зробити прокручування сторінки по рядкам карточок
// 9. зробити візуальний ефект завантаження
//10. переробити в дата-контролері, щоб правильно реагувало на кінець завантаження даних. Завантаження
//    повинно зупинятися коли вже все ...
